print("Hello Coding Python!!")

# 여러 라인의 문열 기록 : """ 
print("""line 1 ...
line2,
line3,
line4...! 
""")

# ==================
# 연산자 - 문자열
# ==================

# 문자열 반복 연산자 
print("Hello " * 3)     # Hello Hello Hello 

# [인덱싱] 문자열중 인덱싱하여 문자 선택 가능 ! 
print("안녕하세요 abc"[2])  # 하 
print("안녕하세요 abc"[-1])  # c

# [슬라이싱] 문자열 범위 지정하여 선택 가능 (마지막 문자 미포함)
print("안녕하세요 abc"[1:4])  # 녕하세 
print("안녕하세요 abc"[3:])  # 세요 abc
print("안녕하세요 abc"[:3])  # 안녕하

# 문자열 길이 구하기 : len()
print(len("안녕하세여"))  # 5


# ==================
# 연산자 - 숫자
# ==================

# 정수 나누기 (소수점 이하 버림): // 
print(35//6) # 5 

# 제곱 연산자 : ** 
print(2**3) # 2 * 2 * 2 = 8





